### Step1: 导入必要的库

In [1]:
import pandas as pd #数据分析
import numpy as np #科学计算

## 数据读取

- 文件格式: 大文件 chunk方式读取
- 数据库：sqlite MySQL MongoDB 等
- 数据采样

## 2.1. 大文件读取

设置列名names\需要的列名usecols

In [41]:
# names = 列名
# ussecols =  需要保留列
data = pd.read_csv('../input/titanic.csv',  sep =',', 
                  index_col = False,iterator = False, error_bad_lines = False)

设置迭代参数 loop\ chunksize\ chunks \count 将每块数据存在list中

In [42]:
# loop = True
# chunksize = 10000
# chunks = []
# count = 0

循环数据读取数据,(捕捉迭代错误)

In [43]:
# while loop:
#     try :
#         chunk = data.get_chunk(chunksize)
#         chunks.append()
#         count += 1
#         if count%1000 ==1:
#             print(count)
            
#     except StopIteration:
#         loop = False
        
#         print("Iteration is stopped")
#     print(count)

合并chunks数据

In [44]:
# data = pd.concat(chunks,ignore_index = True)

## 2.2. 数据库操作

### 2.2.1 sqlite 创建表

In [45]:
import sqlite3

# 数据库名称复制为特定的名称 :memory:，这样就会在 RAM 中创建一个数据库
# conn = sqlite3.connect(':memory:')
conn = sqlite3.connect('../input/test.db')
c = conn.cursor()

In [47]:
c.execute('''CREATE TABLE IF NOT EXISTS COMPANY
       (ID INT PRIMARY KEY     NOT NULL,
       NAME           TEXT    NOT NULL,
       AGE            INT     NOT NULL,
       ADDRESS        CHAR(50),
       SALARY         REAL);''')
print("Table created successfully");
# conn.commit()
# conn.close()

Table created successfully

### 2.2.2 插入数据

In [49]:
#insert 操作
c.execute("INSERT INTO COMPANY (ID,NAME,AGE,ADDRESS,SALARY) \
      VALUES (1, 'Paul', 32, 'California', 20000.00 )");

c.execute("INSERT INTO COMPANY (ID,NAME,AGE,ADDRESS,SALARY) \
      VALUES (2, 'Allen', 25, 'Texas', 15000.00 )");

c.execute("INSERT INTO COMPANY (ID,NAME,AGE,ADDRESS,SALARY) \
      VALUES (3, 'Teddy', 23, 'Norway', 20000.00 )");

c.execute("INSERT INTO COMPANY (ID,NAME,AGE,ADDRESS,SALARY) \
      VALUES (4, 'Mark', 25, 'Rich-Mond ', 65000.00 )");

# conn.commit()
print("Records created successfully");
# conn.close()


### 2.2.3  sqlite 数据读取

In [50]:
#select 操作
cursor = c.execute("SELECT id, name, address, salary  from COMPANY")
for row in cursor:
   print("ID = ", row[0])
   print("NAME = ", row[1])
   print("ADDRESS = ", row[2])
   print("SALARY = ", row[3], "\n")

print("Operation done successfully");
# conn.close()

ID =  1
NAME =  Paul
ADDRESS =  California
SALARY =  25000.0

ID =  2
NAME =  Allen
ADDRESS =  Texas
SALARY =  15000.0

ID =  3
NAME =  Teddy
ADDRESS =  Norway
SALARY =  20000.0

ID =  4
NAME =  Mark
ADDRESS =  Rich-Mond
SALARY =  65000.0

Operation done successfully

#### pandas方式

In [55]:
# pandas 读取
df = pd.read_sql_query("SELECT * FROM COMPANY", conn)
df

   ID   NAME  AGE     ADDRESS   SALARY
0   1   Paul   32  California  25000.0
1   2  Allen   25       Texas  15000.0
2   3  Teddy   23      Norway  20000.0
3   4   Mark   25  Rich-Mond   65000.0

In [56]:
# pandas 写入
data.to_sql('data', conn)

### 2.2.4 修改数据

In [14]:
c.execute("UPDATE COMPANY set SALARY = 25000.00 where ID=1")
conn.commit()
print("Total number of rows updated :", conn.total_changes)

cursor = conn.execute("SELECT id, name, address, salary  from COMPANY")
for row in cursor:
   print("ID = ", row[0])
   print("NAME = ", row[1])
   print("ADDRESS = ", row[2])
   print("SALARY = ", row[3], "\n")

print("Operation done successfully");

Total number of rows updated : 5
ID =  1
NAME =  Paul
ADDRESS =  California
SALARY =  25000.0

ID =  2
NAME =  Allen
ADDRESS =  Texas
SALARY =  15000.0

ID =  3
NAME =  Teddy
ADDRESS =  Norway
SALARY =  20000.0

ID =  4
NAME =  Mark
ADDRESS =  Rich-Mond
SALARY =  65000.0

Operation done successfully

### 2.2.5 删除数据

In [15]:
c.execute("DELETE from COMPANY where ID=2;")

print("Total number of rows updated :", conn.total_changes)

cursor = conn.execute("SELECT id, name, address, salary  from COMPANY")
for row in cursor:
   print("ID = ", row[0])
   print("NAME = ", row[1])
   print("ADDRESS = ", row[2])
   print("SALARY = ", row[3], "\n")

print("Operation done successfully");

Total number of rows updated : 6
ID =  1
NAME =  Paul
ADDRESS =  California
SALARY =  25000.0

ID =  3
NAME =  Teddy
ADDRESS =  Norway
SALARY =  20000.0

ID =  4
NAME =  Mark
ADDRESS =  Rich-Mond
SALARY =  65000.0

Operation done successfully

In [18]:
from sqlalchemy import create_engine

In [33]:
# engine = create_engine('sqlite:///:memory:')
engine = create_engine('sqlite:///test.db')

data.to_sql('data_train',engine,chunksize =1000)

In [ ]:
# 简单的用法

from sqlalchemy import create_engine, MetaData

In [34]:
engine = create_engine('sqlite:///test.sqlite')  
metadata = MetaData(bind=engine, reflect=True)  
conn = engine.connect()  
# 创建表  
conn.execute('CREATE TABLE IF NOT EXISTS user(name VARCHAR, password VARCHAR)')  
# 插入数据  
conn.execute('INSERT INTO user(name, password) VALUES(?, ?)', (('tom', '123'), ('john', '321')))  
# 查询  
for row in conn.execute('SELECT * FROM user'):  
    print(row.name, row['name'], row[0])
 


# 更简单的用法

#  -*- coding: utf-8 -*-  
from sqlalchemy import create_engine, MetaData  
engine = create_engine('sqlite:///test.sqlite')  
# metadata = MetaData(bind=engine, reflect=True)  
# 创建表  
engine.execute('CREATE TABLE IF NOT EXISTS user(name VARCHAR, password VARCHAR)')  
# 插入数据  
engine.execute('INSERT INTO user(name, password) VALUES(?, ?)', [('tom', '123'), ('john', '321')])  
# 查询  
for row in engine.execute('SELECT * FROM user'):  
    print(row.name, row['name'], row[0]  )

tom tom tom
john john john
tom tom tom
john john john
tom tom tom
john john john

/opt/conda/lib/python3.7/site-packages/ipykernel_launcher.py:6: SADeprecationWarning: The MetaData.reflect flag is deprecated and will be removed in a future release.   Please use the MetaData.reflect() method.

### 2.3 数据采样

In [37]:
#sample data two ways

# 1.sklearn
from sklearn.utils import shuffle  
data = shuffle(data)  

# 2.pandas
df = data.sample(frac=0.03)